public_html/Algorithms/Theory of Algorithms/Fisher–Yates shuffle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fisher–Yates shuffle</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Fisher–Yates shuffle"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-08 12:48:59 China Standard Time"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Fisher–Yates shuffle</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">site</a></li>
<li><a href="#sec-2">The modern algorithm</a></li>
<li><a href="#sec-3">The "inside-out" algorithm</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">site</h2>
<div class="outline-text-2" id="text-1">

<p><a href="http://en.wikipedia.org/wiki/Fisher-Yates_shuffle#cite_note-nist-5">http://en.wikipedia.org/wiki/Fisher-Yates_shuffle#cite_note-nist-5</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">The modern algorithm</h2>
<div class="outline-text-2" id="text-2">




<pre class="example">To shuffle an array a of n elements (indices 0..n-1):
  for i from n − 1 downto 1 do
       j ← random integer with 0 ≤ j ≤ i
       exchange a[j] and a[i]
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">The "inside-out" algorithm</h2>
<div class="outline-text-2" id="text-3">




<pre class="example">To initialize an array a of n elements to a randomly shuffled copy of source, both 0-based:
  a[0] ← source[0]
  for i from 1 to n − 1 do
      j ← random integer with 0 ≤ j ≤ i
      a[i] ← a[j]
      a[j] ← source[i]
</pre>


<p>
Another advantage of this technique is that the algorithm can be
modified so that we do not know "n", 
</p>



<pre class="example">To initialize an empty array a to a randomly shuffled copy of source whose length is not known:
  while source.moreDataAvailable
      j ← random integer with 0 ≤ j ≤ a.length
      if j = a.length
          a.append(source.next)
      else
          a.append(a[j])
          a[j] ← source.next
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-08 12:48:59 China Standard Time</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
